Services/arrayOperation/Array_Operation.addWeighted.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
 xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
 xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
 xmlns:xsd="http://www.w3.org/2001/XMLSchema"
 xmlns:ns="urn:aropt">
 <SOAP-ENV:Body SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
  <ns:addWeighted>
   <InputMatFilename1></InputMatFilename1>
   <alpha>0.0</alpha>
   <InputMatFilename2></InputMatFilename2>
   <beta>0.0</beta>
   <gamma>0.0</gamma>
   <dtype-D>-1</dtype-D>
  </ns:addWeighted>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
